OpenFOAM-v2112/tutorials/combustion/fireFoam/LES/compartmentFire/0.orig/N2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.76699;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    entrainment
    {
        type            inletOutlet;
        inletValue      uniform 0.76699;
        value           uniform 0.76699;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.76699;
        value           uniform 0.76699;
    }

    region0_to_panelRegion_wallPanel
    {
        type            zeroGradient;
    }

    region0_to_panelRegion_internalWallPanel_top
    {
        type            zeroGradient;
    }

    region0_to_panelRegion_internalWallPanel_bottom
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
